packetqc/AI/STM32N6/AI_TO_NPU_1/run-23/FSBL/Core/Src/main.c
  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */
  /* NPU RAMs were powered in USER CODE 1; enable the M55 caches. */
  // SystemInit_POST();
  g_boot_stage = 3;
  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_XSPI1_Init();
  MX_XSPI2_Init();
  MX_BSEC_Init();
  MX_USART1_UART_Init();
  MX_RAMCFG_Init();
  MX_ICACHE_Init();
  MX_CACHEAXI_Init();
  SystemIsolation_Config();
  MX_EXTMEM_MANAGER_Init();
  /* USER CODE BEGIN 2 */
  // NPU_Config();
  g_boot_stage = 4;

  /* NPU weights are memory-mapped from XSPI2 NOR @0x71000000 */
  // BSP_XSPI_NOR_Init_t xspiInit;
  // xspiInit.InterfaceMode = MX66UW1G45G_OPI_MODE;
  // xspiInit.TransferRate  = MX66UW1G45G_DTR_TRANSFER;
  // BSP_XSPI_NOR_Init(0, &xspiInit);
  // BSP_XSPI_NOR_EnableMemoryMappedMode(0);
  g_boot_stage = 5;

  // RISAF_Config();
  g_boot_stage = 6;

    /* App logic: bring up the NPU calculator model + run one inference. Traced via MCP
   * (g_boot_stage + step). The REPL (UART I/O) is deferred per focus. */
  /* LLM_FSBL_Init();  ...one inference... */
  g_boot_stage = 7;

  /* LEDS */
  {
    (void)BSP_LED_Init(0U);   /* LED_GREEN = LED1 */
    BSP_LED_Off(0U);
    BSP_LED_On (0U);

    (void)BSP_LED_Init(1U);   /* LED_RED = LED2 */
    BSP_LED_Off(1U);
    BSP_LED_On (1U);
  }

  /* COM TERMINAL */
  {
    /* Initialize COM1 port (115200, 8 bits (7-bit data + 1 stop bit), no parity */
    BspCOMInit.BaudRate   = 115200;
    BspCOMInit.WordLength = COM_WORDLENGTH_8B;
    BspCOMInit.StopBits   = COM_STOPBITS_1;
    BspCOMInit.Parity     = COM_PARITY_NONE;
    BspCOMInit.HwFlowCtl  = COM_HWCONTROL_NONE;
    if (BSP_COM_Init(COM1, &BspCOMInit) != BSP_ERROR_NONE)
    {
      Error_Handler();
    }

    printf( "\x1B[2J" );
    printf("%c[0;0H", 0x1b);
    printf("MAIN APP ON\n");
  }

  /* NPU */
  {
    /* NPU peripheral bring-up: clock + reset. Banks were powered in USER CODE 1;
     * RIF master/slave granted in SystemIsolation_Config; CACHEAXI by MX_CACHEAXI_Init.
     * No NPU register access in code yet (smoke-read via MCP). Ref N6_EDGEAI_1. */
    __HAL_RCC_NPU_CLK_ENABLE();
    __HAL_RCC_NPU_FORCE_RESET();
    __HAL_RCC_NPU_RELEASE_RESET();
    /* The RCC/RIF macros are void (no status). Verify the result instead: if the NPU
     * clock did not engage, printf the detail + trigger the error, per the rule. */
    if (__HAL_RCC_NPU_IS_CLK_ENABLED() == 0U)
    {
      printf("NPU clock enable FAILED (RCC AHB5ENR) - boot_stage=%lu\r\n",
             (unsigned long)g_boot_stage);
      Error_Handler();
    }
    g_boot_stage = 8;

    /* NPU performance: keep the RAM/NPU/cache clocks alive in low-power/sleep (the NPU
     * runs async to the M55) + enable the AXI cache so the NPU's weight/activation
     * accesses are cached — without this the NPU runs at software-fallback speed.
     * Mirrors NPU_Validation set_clk_sleep_mode() + npu_cache_enable(). */
    __HAL_RCC_AXISRAM1_MEM_CLK_SLEEP_ENABLE();   __HAL_RCC_AXISRAM2_MEM_CLK_SLEEP_ENABLE();
    __HAL_RCC_AXISRAM3_MEM_CLK_SLEEP_ENABLE();   __HAL_RCC_AXISRAM4_MEM_CLK_SLEEP_ENABLE();
    __HAL_RCC_AXISRAM5_MEM_CLK_SLEEP_ENABLE();   __HAL_RCC_AXISRAM6_MEM_CLK_SLEEP_ENABLE();
    __HAL_RCC_CACHEAXIRAM_MEM_CLK_SLEEP_ENABLE();
    __HAL_RCC_CACHEAXI_CLK_SLEEP_ENABLE();        __HAL_RCC_NPU_CLK_SLEEP_ENABLE();
    { extern void npu_cache_enable(void); npu_cache_enable(); }  /* HAL_CACHEAXI_Enable */

    /* Grant all CIDs RISAF R/W on the NPU memory (AXISRAM weights @0x34064000 +
     * activations) + the NPU masters + NPU cache — without this the NPU epoch stalls
     * reading the weights. Mirrors NPU_Validation set_risaf_default. */
    {
      RISAF_TypeDef *const npu_risafs[] = { RISAF2_S, RISAF4_S, RISAF5_S, RISAF6_S, RISAF8_S };
      RISAF_BaseRegionConfig_t rc;
      memset(&rc, 0, sizeof(rc));
      rc.StartAddress   = 0x0;
      rc.EndAddress     = 0x0FFFFFFF;
      rc.Filtering      = RISAF_FILTER_ENABLE;
      rc.PrivWhitelist  = RIF_CID_NONE;
      rc.ReadWhitelist  = RIF_CID_MASK;
      rc.WriteWhitelist = RIF_CID_MASK;
      for (unsigned i = 0; i < sizeof(npu_risafs) / sizeof(npu_risafs[0]); i++)
      {
        rc.Secure = RIF_ATTRIBUTE_SEC;
        HAL_RIF_RISAF_ConfigBaseRegion(npu_risafs[i], RISAF_REGION_1, &rc);
        rc.Secure = RIF_ATTRIBUTE_NSEC;
        HAL_RIF_RISAF_ConfigBaseRegion(npu_risafs[i], RISAF_REGION_2, &rc);
      }
    }

    printf("NPU clocked + reset OK + AXI cache + RISAF mem (boot_stage=%lu)\r\n", (unsigned long)g_boot_stage);
  }

  /* NPU MODEL */
  {
    /* Initialize the TCN model context (STAI). Inputs/outputs/weights are preallocated
     * in network.c / network_data.c and placed by the custom linker. */
    g_network = (stai_network *)s_network_ctx;
    stai_return_code rc = stai_network_init(g_network);
    if (rc != STAI_SUCCESS)
    {
      printf("NPU model init FAILED (stai rc=%d) - boot_stage=%lu\r\n",
             (int)rc, (unsigned long)g_boot_stage);
      Error_Handler();
    }
    g_boot_stage = 9;
    printf("NPU HW model init OK (ctx=%u B, weights @0x34064000)\r\n",
           (unsigned)STAI_NETWORK_CONTEXT_SIZE);
  }

  /* NPU INFERENCE (Loop 3c: one compute proof on the Neural-ART) */
  {
    /* Preallocated input/output buffers (the HW network bakes its own activations). */
    stai_ptr in_buf = NULL, out_buf = NULL;
    stai_size n_in = 0, n_out = 0;
    stai_network_get_inputs(g_network, &in_buf, &n_in);
    stai_network_get_outputs(g_network, &out_buf, &n_out);
    if (in_buf == NULL || out_buf == NULL)
    {
      printf("NPU get in/out FAILED\r\n");
      Error_Handler();
    }

    g_boot_stage = 10;
    /* Calculator: parse + evaluate "3 + 4" via the NPU grammar oracle. The runner
     * queries the NPU for each rule (multi-step dialog), parses, and computes. */
    {
      const char *expr = "3 + 4";
      int ok = 0;
      long res = Grammar_Calc(g_network, (int8_t *)in_buf, (const int8_t *)out_buf, expr, &ok);
      if (ok) printf("\r\nCALC: %s = %ld\r\n", expr, res);
      else    printf("\r\nCALC: %s -> parse failed\r\n", expr);
    }
  }

  /* LLM TESTS */
  {
    /* C -> C++ transition test: the C++ TerminalLogger logging via the native printf. */
    TerminalLogger_SmokeTest();
    /* C++ STL infra test (operator new/delete + heap + vector/map/string). */
    Cpp_STL_SmokeTest();
  }

  while (1) /* STAY IN FSBL */
  {
    HAL_Delay(1000);
    BSP_LED_Toggle(0U);
    BSP_LED_Toggle(1U);
  }
  /* USER CODE END 2 */

  /* Launch the application */
  if (BOOT_OK != BOOT_Application())
  {
    Error_Handler();
  }
  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
    /* USER CODE END WHILE */

